{"id":"rd:1pl44e1","platform":"reddit","text":"Easy BiQuad Yagi... maybe I'm trying to build a BiQuad Yagi based off of this design:  \n[https://www.thingiverse.com/thing:3130541](https://www.thingiverse.com/thing:3130541)\n\nWhich is based off of the McNeil design:  \n[https://www.youtube.com/watch?v=TanbyHBKrvU](https://www.youtube.com/watch?v=TanbyHBKrvU)\n\n\n\nOK, with that out of the way, I'm working on a couple of things.  First, I didn't like the design on Thingiverse because bending wires to fit was a royal PITA. Second, I felt like it didn't embrace some of the flexibilities that we could leverage with a 3D printed design.\n\nIt's here that I should probably talk about how I tutored in my college physics courses before not going to med school, and that I have very little real experience with antenna design. I can cut wires to specific lengths. That's about it.\n\n  \nAnd I probably won't be doing that with this prototype...\n\n  \nPictured is a series of 3D printed plates with built in standoffs. The layout is as follows:\n\n  34mm \"Reflector\"\n\n19mm standoff\n\n  31.5mm Driven Element\n\n17mm standoff\n\n  29mm Parasitic Element\n\n17mm standoff\n\n  28mm Parasitic Element\n\n17mm standoof\n\n  27mm Parasitic Element\n\n  \nCurrently I have a coated, stranded, single wire from a telephone cable (Gave me 4 wires of equal length to help me measure). I don't know the gauge or really anything else about the wire (It appears to be copper). The wire is currently placed on the edge of the reflector and parasitic elements.  There is currently no wire on the driven element (Easily added).\n\nI'm going to modify the design to allow for easier wire crossing through the core.\n\nMy questions to the community:\n\nFirst, should the \"lobes\" of the antenna stay square, or will they potentially perform better with a round configuration?\n\n  \nSecond, is there a specific way I should lay the wire out?  In the video, they're using bent wires to form the lobes (Ears? Arms?) of the antenna. In mine, I laid it out within a groove in the edge of the lobe, put the wire there, and hot glue it in place.  Once I modify the core, and use uncoated wire, it will likely lay up in the groove without hot glue. Is that preferable?\n\nWith regards to the wire, I was considering just laying out lengths of wire on each plate and then soldering them together. To put that differently, there is just a single length of wire in this mock up. Instead, should I consider filling the groove with lengths of bare wire, and only move up to the next lobe when the groove cannot take any additional strands of wire? In the current photo, the wire is a single length laid out along the groove, but there are sections where the wire \"climbs\" to the next lobe (or skips the driven lobe completely). Is this the best way to handle this, or should I work at making these wires straighter? (Take a look at the second pic)\n\nFinally, each plate, where it holds the wire, is 3mm wide, with a groove in the edge to seat the wire at the bottom of the groove. I'm thinking the valley/bottom of the groove should be where the \"lobe\" of the wire is measured. I think this should be adjusted out a bit.\n\n  \nIt took me about an hour to glue the wire down, but I learned a ton in the figuring out the technique.  I've got supplies to make a couple of these antennas, but I'm looking for some educated input.","ts":"2025-12-12T21:45:56Z","lang":"","link":"https://www.reddit.com/r/AntennaDesign/comments/1pl44e1/easy_biquad_yagi_maybe/","keywords":[],"source":"reddit-json"}
{"id":"rd:1pkxtgu","platform":"reddit","text":"Fanfics with Yako (Yagi x Inko, I don't know what to call the pairing) Anything is fine, but I enjoy it more when Inko doesn't know that Yagi is All Might and finds out on Kamino. \nFrom here on out, I'm rambling more: but I haven't found a fanfic where Yagi accompanies Inko to the sports festival and the other parents see them.(to see their reaction later on Kamino)","ts":"2025-12-12T17:30:21Z","lang":"","link":"https://www.reddit.com/r/BokunoheroFanfiction/comments/1pkxtgu/fanfics_with_yako_yagi_x_inko_i_dont_know_what_to/","keywords":[],"source":"reddit-json"}
{"id":"rd:1pkq37a","platform":"reddit","text":"How do you connect Yagi Driven Element to Coax(or PCB)? Pretty much the title.   \nI'm trying to build a 440MHz Yagi antenna with inbuilt LNA and balun - and i have trouble connecting the 5mm aluminium pipe(1mm thickness) - the driven element to the PCB with the LNA.\n\nMy best idea right now is to flatten the end of the aluminium pipe and press it down to the pcb with a screw.   \nbut im not sure if i can A)flatten the pipe without it cracking and B) have it electrically sturdy enough.   \n  \nAny ideas?  \nThx a lot","ts":"2025-12-12T11:57:27Z","lang":"","link":"https://www.reddit.com/r/amateurradio/comments/1pkq37a/how_do_you_connect_yagi_driven_element_to_coaxor/","keywords":[],"source":"reddit-json"}
{"id":"rd:1pkmx1s","platform":"reddit","text":"Handheld receivers with extremely high selectivity? Hey all, \n\nDidn't know where to post this, so I'm hoping that yall can help. I'm looking for equipment recommendations to replace an older radio I use for locating transmitters in the field. \n\n For my grad thesis, I basically have to go foxhunt for tiny animal tag VHF transmitters along the coastline. Typical signals are +/-5 KHz around a known frequency and pinging for 15-20 ms roughly every second, usually less than a watt of power. It's the same kind of device they put on birds to track them.\n\nI rely on a Communications Specialists Inc R1000 to scan for the transmitters in the field - we have 2 in the lab and they're built like tanks, but it's only a matter of time until one gets damaged, lost, etc. These systems are literally irreplacable since the only guy who made them retired and all viable replacements are prohibitively expensive. \n\n\nWe tested a Radioditty GA-5, which couldn't detect the transmitter when it was an inch in front of our Yagi - the signal appears to be too narrow. \n\nRTL-SDRs can be tuned to pick it up, but they're not very portable and struggle at longer ranges. I can't exactly take my laptop on an inflatable boat to hunt for a transmitter. \n\nThe official specs from the R1000 are: \n\n148-152 mhz range\n\nCW Receive mode\n\na selectivity of 6dB down @ ± 1.2 KHz, 60dB down @ ± 2.2KHz\n\n50 ohms antenna impedence, \n\n100 Hz step increment\n\nVariable rf gain with 80 dB range.\n\nIs there a commercially available product that can hit these metrics without being super expensive? I don't really want a feature laden supercomputer of a reciever, I want a simple brick I can lend to a colleague or buy on a budget. \n\nThanks for your help!","ts":"2025-12-12T08:33:46Z","lang":"","link":"https://www.reddit.com/r/amateurradio/comments/1pkmx1s/handheld_receivers_with_extremely_high_selectivity/","keywords":[],"source":"reddit-json"}
{"id":"rd:1pklttn","platform":"reddit","text":"Optibeam OBDYA12-5 diagram/manual sharing Hi!\n\nI was looking to change my HF antenna due to its long service (Hy Gain TH3) and I was looking for something a bit bigger with wideband coverage. On the net some of the Optibeam  multiband yagis can be found, but not the model I am looking for.\n\nCould anyone share the manual or the diagram of the antenna? Is this antenna cross fed like a log periodic? There are some videos on YT but it does not seem to be cross-fed on all dipoles.\n\nThank you in advance.\n\n73","ts":"2025-12-12T07:20:49Z","lang":"","link":"https://www.reddit.com/r/amateurradio/comments/1pklttn/optibeam_obdya125_diagrammanual_sharing/","keywords":[],"source":"reddit-json"}
{"id":"rd:1pkh5ti","platform":"reddit","text":"Bugünkü Milli Gazete'nin birinci sayfası \"Erdoğan, “yasa dışı kumar ve bahis ile mücadele” talimatı verdi ama…Kumar tektir, yasal ya da yasa dışı; ikisi de aile yapımızı kökten sarsıyor. Birini destekleyip diğeriyle mücadele edilmeye çalışılması beyhude çabadan öteye geçmez… KUMARIN 'BİR KISMIYLA' MÜCADELE KARARI\"\n#EmekliyiBitirdiAkp\n#GazzeyiUnutma\n@milligazete","ts":"2025-12-12T03:09:45Z","lang":"","link":"https://www.reddit.com/r/Haber_Telvesi/comments/1pkh5ti/bugünkü_milli_gazetenin_birinci_sayfası/","keywords":[],"source":"reddit-json"}
{"id":"rd:1pk2snh","platform":"reddit","text":"Congratulations to AKB48's Azu for reaching 40k followers on Twitter!! (currently 40.9k) [Yagi Azuki]","ts":"2025-12-11T17:04:18Z","lang":"","link":"https://www.reddit.com/r/AKB48/comments/1pk2snh/congratulations_to_akb48s_azu_for_reaching_40k/","keywords":[],"source":"reddit-json"}
{"id":"rd:1pjyf81","platform":"reddit","text":"indirim https://www.hepsiburada.com/magaza/thelifeco?markalar=TheLifeCo","ts":"2025-12-11T14:09:26Z","lang":"","link":"https://www.reddit.com/r/indirimol/comments/1pjyf81/indirim/","keywords":[],"source":"reddit-json"}
{"id":"rd:1pjxtzx","platform":"reddit","text":"Konya-Karaman-Aksaray 6-9 Aralık Toplam Yağış Dağılışı ​Yağış Eğilimi: Yağış miktarı, güneybatıdaki Akdeniz'e yakın dağlık bölgelerden (Toros Dağları) başlayarak kuzeydoğuya, iç kısımlara ve en önemlisi Tuz Gölü çevresindeki düzlüklere doğru hızla azalmaktadır.\n\n​Topografyanın Etkisi: Yağış dağılışındaki en belirgin faktör yükseltidir. Dağlık bölgeler (örneğin Beyşehir Gölü'nün batısı, Konya'nın güneyindeki Toroslar) belirgin şekilde daha fazla yağış alırken, düz ve alçak iç bölgeler (Tuz Gölü, Aksaray) kurak kalmıştır.\n\n​Bu harita, Aralık ayının başındaki 4 günlük dönemde bölgenin yağış rejimini çok net bir şekilde özetlemektedir.","ts":"2025-12-11T13:43:06Z","lang":"","link":"https://www.reddit.com/r/haritalariseviyoruz/comments/1pjxtzx/konyakaramanaksaray_69_aralık_toplam_yağış/","keywords":[],"source":"reddit-json"}
{"id":"rd:1pjxfdx","platform":"reddit","text":"Happy 19th birthday to Miki Yagi, Minami Yorozu.","ts":"2025-12-11T13:24:14Z","lang":"","link":"https://www.reddit.com/r/KamenRiderMemes/comments/1pjxfdx/happy_19th_birthday_to_miki_yagi_minami_yorozu/","keywords":[],"source":"reddit-json"}
